docs/KIMBALL.md
```mermaid
erDiagram
    dim_fecha ||--o{ fact_operaciones_logisticas : "registro / entrega"
    dim_cliente ||--o{ fact_operaciones_logisticas : "cliente"
    dim_estado ||--o{ fact_operaciones_logisticas : "estado actual"
    dim_operador ||--o{ fact_operaciones_logisticas : "responsable"

    dim_fecha {
        int id_fecha PK
        date fecha
        smallint anio
        tinyint trimestre
        tinyint mes
        tinyint es_fin_semana
    }
    dim_cliente {
        int id_dim_cliente PK
        int id_cliente_origen
        varchar razon_social
        varchar ruc
        varchar segmento
    }
    dim_estado {
        int id_dim_estado PK
        int id_estado_origen
        varchar codigo
        varchar nombre
        tinyint es_final
    }
    dim_operador {
        int id_dim_operador PK
        int id_usuario_origen
        varchar nombre_completo
        varchar rol
    }
    fact_operaciones_logisticas {
        bigint id_fact PK
        int id_envio UK
        int id_fecha_registro FK
        int id_fecha_entrega FK
        int id_dim_cliente FK
        int id_dim_estado FK
        int id_dim_operador FK
        varchar codigo_envio
        decimal peso_kg
        int dias_transito
        int cantidad_incidencias
        tinyint tuvo_retraso
        tinyint entregado_a_tiempo
        enum origen_dato
    }
```
